mi_list = [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5]
ind = 0                     # создал новуюпеременныю которую буду использовать в дальнейсшем, присвоил ей значение равное значению первого индекса в строке.
while ind < len(mi_list):   # цыкл while будет исполняться пока новач переменная меньше длинны строки
    element = mi_list[ind]  # создал новую переменную, приравнял ее к элементу индекса индекса строки назвал tltvtyn
    if element < 0:         # создал условие if чтобы прервать цикл елси значение индекса меньше 0
        break
    if element > 0:         # создалусловие if где elment если element больше 0 он был наспечатан
        print(element)
    ind += 1                # условие цикла где цикл запускаеся соследующего индекса














